[
    {
        "id": "01",
        "name": "AMD Ryzen 9 7950X Processor",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/processor/amd/amd-ryzen-9-7950x/amd-ryzen-9-7950x-processor.jpg-550x550.jpg",
        "description": "The AMD Ryzen 9 7950X CPU is built on the Zen4 microarchitecture and boasts 16 cores with two Durango CCDs named \"Persephone\". According to a leaker, the top CPU contenders will be the 7950X clocking in at 5.7 GHz and the i9-13900K with a supposed boost of up to 5.8 GHz through Thermal Velocity Boost. However, the sample described by \"Venom\" is not the highest performing CPU available.",
        "price": "56000",
        "category": "processor",
        "rating": "5",
        "brand": "AMD",
        "creation_time": "2020-07-11 19:20:35"
    },
    {
        "id": "02",
        "brand": "AMD",
        "name": "AMD Ryzen 9 7900X3D Processor",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/processor/amd/ryzen-9-7900x3d/amd-ryzen-9-7900x3d-gaming-processor.jpg-550x550.jpg",
        "description": "AMD Ryzen 9 7900X 3D Gaming Processor is the perfect choice for gamers who want to perform at the highest level. This remarkable processor combines powerful processor performance and advanced graphical capabilities. It offers great features like USB Type-C® Support, with native USB 3.2 Gen 2 (10Gbps) ports, and no native USB 3.2 Gen 1 (5Gbps) or native USB 2.0 (480Mbps) ports, leaving it with plenty of room to breathe. Additional usable PCIe lanes from motherboard options such as AMD X670E 12x Gen4, AMD X670 12x Gen4, AMD B650E 8x Gen4, and AMD B650 8x Gen4, all make for a superior gaming experience. Also included are native support for NVMe support, ECC support, integrated AMD Radeon™ Graphics, and DDR5 memory with up to 128GB of RAM running at speeds of up to 2x1R DDR5-5200 or 2x2R DDR5-5200, perfect for running the latest games, software, and music. Whether you’re a hardcore gamer looking for a reliable processor to keep up with demanding games, or simply just looking for a reliable processor to help make your life easier, the AMD Ryzen 9 7900X 3D Gaming Processor is the perfect choice for you.",
        "price": "44000",
        "category": "processor",
        "rating": "5",
        "creation_time": "2020-05-29 20:21:12"
    },
    {
        "id": "03",
        "brand": "intel",
        "name": "Intel 13th Gen Core i9-13900K Raptor Lake Processor",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/processor/intel/i9-13900k/intel-13th-gen-core-i9-13900k-processor.jpg-550x550.jpg",
        "description": "Intel 13th Gen Core i9-13900K Desktop Raptor Lake Processor features a performance hybrid architecture that is designed for intelligent performance and optimized creation. With up to 8 performance cores and 16 efficient cores, this processor can handle any task you throw at it. Additionally, the 13th Gen Intel Core i9-13900K processors advance performance hybrid architecture with up to eight Performance-cores (P-core) and up to 16 Efficient-cores (E-core), combined with workloads intelligently routed to the right cores for the task, for a new level of performance.The Intel 13th Gen Core i9-13900K Desktop Raptor Lake Processor is a powerful CPU that utilizes Intel's performance hybrid architecture. This processor has an increased core count, which allows it to handle more tasks simultaneously. It also has a powerful suite of tuning and overclocking tools. The Intel Core i9-13900K is compatible with the Intel 700 series chipsets and backward compatible with the Intel 600 series chipsets.",
        "price": "67500",
        "category": "processor",
        "rating": "5",
        "creation_time": "2024-04-24 18:44:35"
    },
    {
        "id": "04",
        "brand": "intel",
        "name": "Intel 13th Gen Core i7 13700KF Raptor Lake Processor",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/processor/intel/13700kf/intel-13th-gen-core-i7-13700kf-processor.jpg-550x550.jpg",
        "description": "The AMD Ryzen 9 7950X CPU is built on the Zen4 microarchitecture and boasts 16 cores with two Durango CCDs named \"Persephone\". According to a leaker, the top CPU contenders will be the 7950X clocking in at 5.7 GHz and the i9-13900K with a supposed boost of up to 5.8 GHz through Thermal Velocity Boost. However, the sample described by \"Venom\" is not the highest performing CPU available.",
        "price": "43000",
        "category": "processor",
        "rating": "5",
        "creation_time": "2022-04-29 10:47:58"
    },
    {
        "id": "05",
        "brand": "intel",
        "name": "Intel Core i5-13500 13TH GEN RAPTOR LAKE PROCESSOR",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/processor/intel/i5-13500/intel-core-i5-13500-13th-gen-processor.jpg-550x550.jpg",
        "description": "The Intel 13th Generation Core i5 13500 Processor is specifically designed for compatibility with the LGA1700 Socket. With an impressive 14 cores, this CPU effortlessly handles even the most demanding workloads. Thanks to Intel Hyper-Threading technology, it effectively boosts its core count to 20 threads, further enhancing its multitasking capabilities. Additionally, it boasts a generous 24MB of L3 cache, ensuring quick access to frequently used data. The Core i5-13500 operates at a base frequency of 2.5 GHz, but it can dynamically increase its clock speed to a maximum of 4.8 GHz, depending on the workload at hand. This versatility ensures that the processor can handle a wide range of tasks with ease. Built on a 10 nm manufacturing process, the Core i5-13500 offers an optimal balance between power and efficiency. While it has a locked multiplier, limiting its overclocking potential, it still delivers excellent performance with a remarkably low thermal design power (TDP) of only 65 W.This processor supports both DDR4 and DDR5 memory, utilizing a dual-channel interface for enhanced data transfer speeds. It communicates seamlessly with other system components through a PCI-Express Gen 5 link, ensuring swift and efficient data exchanges. Furthermore, the Core i5-13500 features the integrated UHD Graphics 770 solution, providing capable graphics performance for everyday tasks and light gaming.",
        "price": "29000",
        "category": "processor",
        "rating": "5",
        "creation_time": "2022-12-14 06:42:43"
    },
    {
        "id": "06",
        "brand": "MSI",
        "name": "MSI MAG B650 TOMAHAWK WIFI DDR5 AMD AM5 ATX Motherboard",
        "image": "https://www.potakait.com/image/cache/catalog/motherboard/AMD/MSI/mag-b650-tomahawk-wifi-01-500x500.jpg-550x550.jpg",
        "description": "The MSI MAG B650 TOMAHAWK WIFI Motherboard is a high-performance ATX solution designed to unleash the full potential of AMD's latest Ryzen 7000 and 8000 series processors. Packed with cutting-edge features, robust cooling, and a stylish design, this motherboard is ideal for gamers, content creators, and PC enthusiasts who demand the best.",
        "price": "31000",
        "category": "motherboard",
        "rating": "5",
        "creation_time": "2021-04-27 10:55:40"
    },
    {
        "id": "07",
        "brand": "MSI",
        "name": "MSI X670E GAMING PLUS WIFI AM5 ATX Motherboard",
        "image": "https://www.potakait.com/image/cache/catalog/motherboard/AMD/MSI/x670e-gaming-plus-wifi-01-500x500.jpg-550x550.jpg",
        "description": "The MSI X670E GAMING PLUS WIFI motherboard is a powerful contender for gamers and PC enthusiasts seeking a feature-rich foundation for their next AMD Ryzen build. It offers a compelling blend of performance, cutting-edge features, and affordability, making it a solid choice for users who prioritize value without sacrificing quality.",
        "price": "33500",
        "category": "motherboard",
        "rating": "5",
        "creation_time": "2023-10-24 22:58:47"
    },
    {
        "id": "08",
        "brand": "NZXT",
        "name": "NZXT N7 Z590 Matte White Intel 11th and 10th Gen ATX Wi-Fi Gaming Motherboard",
        "image": "https://www.potakait.com/image/cache/catalog/motherboard/NZXT/n7-z590-white-02-500x500.jpg-550x550.jpg",
        "description": "The NZXT N7 Z590 Matte White motherboard presents a seamlessly stylish foundation for any build while incorporating all the latest features of the Intel Z590 chipset. Designed to accommodate Intel Socket LGA1200 processors, including the 11th Generation Core i9, Core i7, Core i5, and Core i3, it boasts a robust 12+2 DrMOS Power Phase Design for reliable performance. Supporting memory overclocking up to 4266 MHz and Intel XMP 2.0, it ensures optimal memory performance. With built-in Intel Wifi 6E wireless connectivity and Bluetooth V5.2, it offers advanced wireless capabilities. Additionally, it is Intel Optane Memory Ready and provides two M.2 connectors for storage devices. Multi-GPU support with AMD CrossFireX Technology enhances graphical performance, while Digital RGB lighting control via NZXT CAM allows for customizable lighting effects. Digital fan control for seven independent fan channels within NZXT CAM ensures efficient cooling management. Featuring an integrated rear I/O shield and a well-thought-out layout, it offers convenience and ease of use. The motherboard also boasts 8-channel high-definition audio for immersive sound quality. Backed by a 3-year warranty, the NZXT N7 Z590 Matte White motherboard is a reliable choice for discerning builders.",
        "price": "25500",
        "category": "motherboard",
        "rating": "5",
        "creation_time": "2020-08-23 14:27:32"
    },
    {
        "id": "09",
        "brand": "MSI",
        "name": "MSI MAG Z790 TOMAHAWK WIFI 12th and 13th Gen ATX Motherboard",
        "image": "https://www.potakait.com/image/cache/catalog/motherboard/Intel/MSI/mag-z790-tomahawk-wifi-01-500x500.jpg-550x550.jpg",
        "description": "Take your gaming and office productivity experience to the next level with the all-new MSI MSI MAG Z790 TOMAHAWK WIFI DDR4 Motherboard. Featuring the highly efficient and reliable 12th Gen Intel Core, Pentium Gold and Celeron processors.",
        "price": "41500",
        "category": "motherboard",
        "rating": "5",
        "creation_time": "2023-02-03 20:11:56"
    },
    {
        "id": "10",
        "brand": "maxsun",
        "name": "MAXSUN iCraft Z790 White V2 WiFi LGA1700 DDR5 Motherboard",
        "image": "https://www.potakait.com/image/cache/catalog/motherboard/MAXSUN/790-500x500w.jpg-550x550.jpg",
        "description": "MAXSUN iCraft Z790 White V2 WiFi LGA1700 DDR5 Motherboard, a cutting-edge platform designed to elevate your computing experience to new heights. Boasting a host of advanced features and specifications, this motherboard is engineered to meet the demands of modern computing tasks with unparalleled efficiency and reliability. At the heart of the iCraft Z790 motherboard lies the powerful INTEL Z790 chipset, offering exceptional performance and seamless connectivity. With support for 12th/13th/14th Gen Intel® Core™ Processors, Pentium® Gold, and Celeron® Processors LGA 1700, it ensures compatibility with a wide range of CPU options, catering to various computing needs.",
        "price": "32500",
        "category": "motherboard",
        "rating": "5",
        "creation_time": "2021-10-02 08:08:49"
    },
    {
        "id": "11",
        "brand": "asus",
        "name": "Asus ROG RYUJIN III 360 AIO 3.5\" LCD Display Liquid CPU Cooler",
        "image": "https://www.potakait.com/image/cache/catalog/CPU%20Cooler/Asus/rog-ryujin-iii-360-01-500x500.jpg-550x550.jpg",
        "description": "Enhance your gaming PC's performance with the Asus ROG RYUJIN III 360 AIO Liquid CPU Cooler. Boasting a cutting-edge cooling system featuring three 120mm fans, this top-tier setup ensures optimal airflow for efficient heat dissipation while maintaining a compact footprint. Elevate your gaming experience with the eye-catching 3.5-inch Full-Color LCD display, perfect for showcasing live system metrics, personalized artwork, or animated GIFs, adding a dynamic visual dimension to your gaming rig.",
        "price": "49000",
        "category": "CPU Cooler",
        "rating": "5",
        "creation_time": "2022-06-09 18:13:51"
    },
    {
        "id": "12",
        "brand": "asus",
        "name": "Asus ROG RYUJIN III 360 ARGB AIO 3.5\" LCD Display Liquid CPU Cooler (White)",
        "image": "https://www.potakait.com/image/cache/catalog/CPU%20Cooler/Asus/71FZDxFDRZL._AC_SX679_.jpg-550x550w.jpg",
        "description": "Enhance your gaming PC's performance with the Asus ROG RYUJIN III 360 ARGB AIO Liquid CPU Cooler (White). Boasting a cutting-edge cooling system featuring three 120mm fans, this top-tier setup ensures optimal airflow for efficient heat dissipation while maintaining a compact footprint. Elevate your gaming experience with the eye-catching 3.5-inch Full-Color LCD display, perfect for showcasing live system metrics, personalized artwork, or animated GIFs, adding a dynamic visual dimension to your gaming rig.",
        "price": "55000",
        "category": "CPU Cooler",
        "rating": "5",
        "creation_time": "2021-01-30 20:54:31"
    },
    {
        "id": "13",
        "brand": "EKWB",
        "name": "EKWB EK-AIO Elite Aurum 360 D-RGB CPU Cooler",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/cpu-coolers/ekwb/ek-aio-elite-aurum-360-d-rgb/ekwb-ek-aio-elite-aurum-360-d-rgb-cpu-cooler.jpg-550x550.jpg",
        "description": "The EK-AIO Elite Aurum 360 D-RGB is an all-in-one liquid cooling solution for your CPU, boasting a six-fan setup for even better cooling performance. It offers all the benefits of a water-cooling solution in an easy to install and maintenance-free design. The EK AIO Elite Aurum comes with a universally compatible CPU water-block, along with a pre-filled pump-res combo design for a liquid cooling solution that’s ready to go straight out of the box. This Special Edition AIO is dressed in a glossy finish, featuring a golden nickel plated pump cover and diamond-cut gold fittings.",
        "price": "26000",
        "category": "CPU Cooler",
        "rating": "5",
        "creation_time": "2021-05-09 18:00:23"
    },
    {
        "id": "14",
        "brand": "NZXT",
        "name": "NZXT Kraken Z53 240mm All-in-One Liquid CPU Cooler",
        "image": "https://www.potakait.com/image/cache/catalog/CPU%20Cooler/NZXT/kraken-z53-500x500.jpg-550x550.jpg",
        "description": "Experience unparalleled liquid cooling performance and aesthetic brilliance with the NZXT Kraken Z53 240mm All-in-One Liquid CPU Cooler. Enhanced with NZXT RGB fans, this cooler boasts a re-imagined cap and an expanded infinity mirror ring LED, elevating your build to new visual heights. Equipped with the latest 7th Gen Asetek pump, it ensures superior cooling efficiency alongside whisper-quiet operation at 800RPM. The package includes two Aer RGB 2 120 fans, offering a variable speed range from 500 to 1,500 RPM with an additional 300 RPM boost. Seamlessly compatible with NZXT RGB accessories or Aer RGB 2 fans via the NZXT RGB connector, customization is effortless. Plus, with a reassuring 5-year warranty, indulge in the ultimate cooling solution with peace of mind.",
        "price": "21500",
        "category": "CPU Cooler",
        "rating": "5",
        "creation_time": "2022-01-22 12:15:40"
    },
    {
        "id": "15",
        "brand": "asus",
        "name": "Asus ROG RYUJIN 360mm OLED All In One Liquid CPU Cooler",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/cpu-coolers/asus/rog-ryujin-360/asus-rog-ryujin-360mm-oled-all-in-one-liquid-cpu-cooler.jpg-550x550.jpg",
        "description": "Experience unparalleled liquid cooling performance and aesthetic brilliance with the NZXT Kraken Z53 240mm All-in-One Liquid CPU Cooler. Enhanced with NZXT RGB fans, this cooler boasts a re-imagined cap and an expanded infinity mirror ring LED, elevating your build to new visual heights. Equipped with the latest 7th Gen Asetek pump, it ensures superior cooling efficiency alongside whisper-quiet operation at 800RPM. The package includes two Aer RGB 2 120 fans, offering a variable speed range from 500 to 1,500 RPM with an additional 300 RPM boost. Seamlessly compatible with NZXT RGB accessories or Aer RGB 2 fans via the NZXT RGB connector, customization is effortless. Plus, with a reassuring 5-year warranty, indulge in the ultimate cooling solution with peace of mind.",
        "price": "27500",
        "category": "CPU Cooler",
        "rating": "5",
        "creation_time": "2021-12-15 20:48:01"
    },
    {
        "id": "16",
        "brand": "asus",
        "name": "ASUS ROG STRIX GEFORCE RTX 4090 OC EDITION GDDR6X 24GB GRAPHICS CARD",
        "image": "https://www.potakait.com/image/cache/catalog/graphics%20card/ASUS/asus-rtx-4090-oc-24gb-graphics-card.jpg-550x550.jpg",
        "description": "The ASUS ROG STRIX GEFORCE RTX 4090 OC EDITION is an incredibly powerful graphics card specifically designed for high-end gaming and video editing purposes. It boasts an impressive NVIDIA® GeForce RTX™ 4090 graphic engine and utilizes the fast PCI Express 4.0 bus standard, ensuring smooth and efficient performance. Equipped with 24GB GDDR6X video memory and an engine clock speed of up to 2640 MHz in OC mode, it effortlessly handles demanding tasks with ease. The CUDA core count is an impressive 16384, and the memory speed reaches 21 Gbps, utilizing a 384-bit memory interface.",
        "price": "335000",
        "category": "GPU",
        "rating": "5",
        "creation_time": "2021-04-13 08:41:22"
    },
    {
        "id": "17",
        "brand": "gigabyte",
        "name": "GIGABYTE GeForce RTX 4090 GAMING OC 24GB GDDR6X Graphics Card",
        "image": "https://www.potakait.com/image/cache/catalog/graphics%20card/Gigabyte/geforce-rtx-4090-gaming-oc-24g-01-500x500.jpg-550x550.jpg",
        "description": "GIGABYTE GeForce RTX 4090 GAMING OC 24GB Graphics Card, a cutting-edge GPU that combines powerful performance with innovative features. This graphics card boasts an impressive 24GB GDDR6X 384-bit memory interface, ensuring lightning-fast data access for smoother gaming and rendering experiences. It is powered by NVIDIA Ada Lovelace Streaming Multiprocessors, unlocking the potential for unprecedented processing capabilities.",
        "price": "287000",
        "category": "GPU",
        "rating": "5",
        "creation_time": "2021-10-18 20:49:23"
    },
    {
        "id": "18",
        "brand": "MSI",
        "name": "MSI GeForce RTX 4090 GAMING X SLIM 24GB GDDR6X Graphics Card",
        "image": "https://www.potakait.com/image/cache/catalog/Graphics%20Card/MSI/MSI%201/rtx-4090-gaming-x-slim-24g-01-500x500.jpg-550x550.jpg",
        "description": "The MSI GeForce RTX 4090 GAMING X SLIM 24GB GDDR6X is a top-of-the-line graphics card based on the NVIDIA Ada Lovelace architecture. It boasts impressive features for exceptional performanc",
        "price": "286000",
        "category": "GPU",
        "rating": "5",
        "creation_time": "2024-06-20 06:56:37"
    },
    {
        "id": "19",
        "brand": "yeston",
        "name": "Yeston Radeon RX 7900 XTX 24GB GDDR6 Sakura Sugar Graphics Card",
        "image": "https://www.potakait.com/image/cache/catalog/graphics%20card/Yeston/rx-7900-xtx-20.jpg-550x550.jpg",
        "description": "The Yeston Radeon RX 7900 XTX 24GB Sakura Sugar Graphics Card stands as a pinnacle of high-performance excellence tailored for both gamers and demanding graphics-intensive tasks. Boasting the formidable 7900XTX core code and a state-of-the-art 5nm manufacturing process, this graphics card guarantees efficiency and top-tier performance.",
        "price": "140000",
        "category": "GPU",
        "rating": "5",
        "creation_time": "2021-02-25 23:34:12"
    },
    {
        "id": "20",
        "brand": "intel",
        "name": "GUNNIR Intel Arc A770 Flux 16G OC Graphics Card",
        "image": "https://www.potakait.com/image/cache/catalog/graphics%20card/Gunnir/fluex%2016.jpg-550x550.jpg",
        "description": "The GUNNIR Intel Arc A770 Flux 16G OC graphics card is the latest addition to GUNNIR's high-end lineup, merging cutting-edge technology with a sleek, sci-fi inspired design. Engineered for enthusiasts, this card not only excels in performance but also stands out with its innovative and futuristic aesthetic.",
        "price": "170000",
        "category": "GPU",
        "rating": "5",
        "creation_time": "2022-12-08 02:11:50"
    },
    {
        "id": "21",
        "brand": "antec",
        "name": "Antec HCG 1000 Gold Fully Modular Power Supply",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/power-supply/antec-psu/hcg-1000/antec-hcg-1000-gold-fully-modular-power-supply_11zon.jpg-550x550.jpg",
        "description": "Engineered To Meet The Power Demands Of High-End Systems, The Antec High Current Gamer Gold Power Supply Series Boasts Unequaled Stability And 80 PLUS  Gold-Certified Effectiveness, Thanks To The Top-Grade Japanese Capacitors And ActivePFC. Advanced Thermal Control With The Zero RPM Mode Enables Optimal Balance Between Silence And Cooling, And A Quiet 135 Mm Fluid Dynamic Bearing Fan Completes The Package. The Circuit Shield Suite Of Artificial-Grade Protections Ensures That The Power Delivered To Your System Is Safe And Reliable. However, High-Position Engineering And Extreme Effectiveness Are What You’re After, The HCG Gold Series Is The Ideal Antec HCG 1000 Gold Power Supply In Any Situation If Loads Of Power.",
        "price": "17000",
        "category": "PSU",
        "rating": "5",
        "creation_time": "2024-01-07 23:49:36"
    },
    {
        "id": "22",
        "brand": "antec",
        "name": "Antec HCG1000 Extreme 1000 Watt Power Supply",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/power-supply/antec-psu/hcg1000-extreme-1000-watt-power-supply/antec-hcg1000-extreme-1000-watt-power-supply.jpg-550x550.jpg",
        "description": "Engineered To Meet The Power Demands Of High-End Systems, The Antec High Current Gamer Gold Power Supply Series Boasts Unequaled Stability And 80 PLUS  Gold-Certified Effectiveness, Thanks To The Top-Grade Japanese Capacitors And ActivePFC. Advanced Thermal Control With The Zero RPM Mode Enables Optimal Balance Between Silence And Cooling, And A Quiet 135 Mm Fluid Dynamic Bearing Fan Completes The Package. The Circuit Shield Suite Of Artificial-Grade Protections Ensures That The Power Delivered To Your System Is Safe And Reliable. However, High-Position Engineering And Extreme Effectiveness Are What You’re After, The HCG Gold Series Is The Ideal Antec HCG 1000 Gold Power Supply In Any Situation If Loads Of Power.",
        "price": "18500",
        "category": "PSU",
        "rating": "5",
        "creation_time": "2022-09-21 21:53:11"
    },
    {
        "id": "23",
        "brand": "antec",
        "name": "Antec Signature PLATINUM 1300 1300W 80 Plus Platinum Fully Modular Power Supply",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/power-supply/antec-psu/x8000a506-18/antec-signature-platinum-1300-1300w-80-plus-platinum-fully-modular-power-supply.jpg-550x550.jpg",
        "description": "Equipped with superior features that ensure peak performance for the enthusiast and gaming-oriented segment, the Signature power supply Series boasts unparalleled stability and 80 PLUS® Platinum-certified efficiencies. Advanced thermal control with the Zero RPM mode enables the optimal balance between silence and cooling. The CircuitShield™ suite of industrial-grade protections ensures that the power delivered to your system is safe and reliable in any environment. Signature Series are a great choice for a reliable and efficient PC system for gamers and professionals.",
        "price": "26500",
        "category": "PSU",
        "rating": "5",
        "creation_time": "2020-07-07 09:10:31"
    },
    {
        "id": "24",
        "brand": "NZXT",
        "name": "NZXT C1200 80 Plus Gold Full Modular 1200 Watt Power Supply",
        "image": "https://www.potakait.com/image/cache/catalog/Power/NZXT/c1200-01-500x500.jpg-550x550.jpg",
        "description": "The NZXT C1200 80 Plus Gold Full Modular 1200 Watt Power Supply is engineered to deliver robust and consistent power to demanding gaming and computing setups. Adhering to the ATX v3.0 power standard, this PSU offers top-notch performance and features tailored to meet the needs of power users. With its innovative 16-pin PCIe 12VHPWR connector, the NZXT C1200 Gold can supply an impressive 600 watts of power to NVIDIA 40-series graphics cards using a single cable, ensuring optimal performance without bottlenecks. NZXT's commitment to quality and reliability is evident in every unit, as each undergoes rigorous testing to ensure trouble-free installation and optimal performance under heavy loads. The NZXT C1200 Gold achieves an exceptional 90.5% efficiency peak at 50% load, resulting in reduced temperatures",
        "price": "24500",
        "category": "PSU",
        "rating": "5",
        "creation_time": "2022-08-01 20:15:13"
    },
    {
        "id": "25",
        "brand": "MSI",
        "name": "MSI MAG A850GL PCIE5 850W 80 Plus Gold Full Modular Power Supply",
        "image": "https://www.potakait.com/image/cache/catalog/power%20supply/msi/mag-a850gl-pcie5-850w-01-500x500.jpg-550x550.jpg",
        "description": "The MSI MAG A850GL PCIE5 850W is a powerhouse PSU designed for gamers and professionals who demand unwavering performance and cutting-edge features. This 850W 80 Plus Gold certified unit is built to handle even the most power-hungry systems, including those with multi-GPU configurations.",
        "price": "14500",
        "category": "PSU",
        "rating": "5",
        "creation_time": "2020-07-02 05:09:55"
    },
    {
        "id": "26",
        "brand": "lexar",
        "name": "Lexar Ares RGB 16GB DDR5 6800MHz Gaming Desktop RAM",
        "image": "https://www.potakait.com/image/cache/catalog/Ram/Lexar/ARESRGBDDR56400_slider_32GB_4.jpg-550x550.jpg",
        "description": "Lexar ARES RGB DDR5 Desktop Memory—a game-changer for hardcore gamers and PC enthusiasts seeking the pinnacle of computing excellence. Harnessing the power of next-gen DDR5 technology, this memory module is designed to redefine your gaming experience.",
        "price": "9000",
        "category": "RAM",
        "rating": "5",
        "creation_time": "2024-04-22 05:41:38"
    },
    {
        "id": "27",
        "brand": "lexar",
        "name": "Lexar Ares RGB 16GB DDR5 6800MHz Gaming Desktop RAM",
        "image": "https://www.potakait.com/image/cache/catalog/Ram/Lexar/ARESRGBDDR5.jpg-550x550.jpg",
        "description": "Lexar ARES RGB DDR5 Desktop Memory—a game-changer for hardcore gamers and PC enthusiasts seeking the pinnacle of computing excellence. Harnessing the power of next-gen DDR5 technology, this memory module is designed to redefine your gaming experience.",
        "price": "9500",
        "category": "RAM",
        "rating": "5",
        "creation_time": "2022-02-21 08:12:28"
    },
    {
        "id": "28",
        "brand": "team",
        "name": "Team DELTA 16GB 6400MHz DDR5 RGB White Desktop Gaming RAM",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/ram(desktop)/delta-16gb-6400mhz-ddr5-rgb/team-delta-16gb-6400mhz-ddr5-rgb-white-desktop-gaming-ram_11zon.jpg-550x550.jpg",
        "description": "Team DELTA Desktop Gaming RAM Comes With 16GB Capacity,6400MHz Speed, And This RAm Is DDR5 Type RAM. The Team DELTA Featured RGB Colors & 120° Ultra-Wide Lighting, Power Management ICs (PMIC) Equipped For Stable, Efficient Power Usage Strengthened PMIC Cooling Design And On-Die ECC For Stable System. This Gaming RAM Supports Intel XMP3.0 For One-Click Overclocking. This RAM Has High-Quality ICs Selected For Stability & Reliability. The Team DELTA Desktop Gaming RAM Is Equipped With Smart RGB IC Controller That Supports Various Lighting Effect Software.",
        "price": "31500",
        "category": "RAM",
        "rating": "5",
        "creation_time": "2024-03-08 01:48:16"
    },
    {
        "id": "29",
        "brand": "team",
        "name": "Team DELTA 16GB 6400MHz DDR5 RGB Black Desktop Gaming RAM",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/ram(desktop)/delta-16gb-6400mhz/team-delta-16gb-6400mhz-ddr5-rgb-black-desktop-gaming-ram_11zon.jpg-550x550.jpg",
        "description": "Team DELTA Desktop Gaming RAM Comes With 16GB Capacity,6400MHz Speed, And This Ram Is DDR5 Type RAM. The Team DELTA Featured RGB Colors & 120° Ultra-Wide Lighting, Power Management ICs (PMIC) Equipped For Stable, Efficient Power Usage Strengthened PMIC Cooling Design And On-Die ECC For Stable System. This Gaming RAM Supports Intel XMP3.0 For One-Click Overclocking. This RAM Has High-Quality ICs Selected For Stability & Reliability. The Team DELTA Desktop Gaming RAM Is Equipped With Smart RGB IC Controller That Supports Various Lighting Effect Software.",
        "price": "22500",
        "category": "RAM",
        "rating": "5",
        "creation_time": "2023-06-09 17:10:31"
    },
    {
        "id": "30",
        "brand": "colorful",
        "name": "Colorful CVN Icicle 16GB DDR5 6600MHz Desktop RAM",
        "image": "https://www.potakait.com/image/cache/catalog/Ram/Colorful/cvn-icicle-01-500x500.jpg-550x550.jpg",
        "description": "The Colorful Battle-AX 16GB (8*2) DDR4 3200MHz U-DIMM Desktop RAM is a budget-friendly option for users looking to upgrade their computer's memory and improve overall system performance for basic tasks.",
        "price": "16500",
        "category": "RAM",
        "rating": "5",
        "creation_time": "2021-08-16 07:55:28"
    },
    {
        "id": "31",
        "brand": "seagate",
        "name": "Seagate IronWolf 125 2TB 2.5-inch SATA III SSD",
        "image": "https://www.potakait.com/image/cache/catalog/SSD/Seagate/ironwolf-125-500gb-01-500x500%20(1).jpg-550x550.jpg",
        "description": "Designed for demanding workloads in multi-user NAS environments, the Seagate IronWolf 125 2TB 2.5-inch SATA III SSD boasts exceptional performance and reliability. Here's a closer look at its feature",
        "price": "47500",
        "category": "SSD",
        "rating": "5",
        "creation_time": "2021-01-17 18:48:26"
    },
    {
        "id": "32",
        "brand": "samsung",
        "name": "Samsung 870 QVO 4TB 2.5\" SATA III SSD",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/ssd/870_qvo_4tb_25/samsung_870_qvo_4tb_25_sata_iii_ssd_11zon.jpg-550x550.jpg",
        "description": "The 870 QVO is Samsung’s latest 2nd gen. QLC SSD and the largest of its kind that provides up to 8TB of storage. Offering an incredible upgrade for everyday PC users who want to ramp-up their desktop PC or laptop to the largest available storage in the market without compromising on performance.",
        "price": "40500",
        "category": "SSD",
        "rating": "5",
        "creation_time": "2020-12-05 05:20:54"
    },
    {
        "id": "33",
        "brand": "seagate",
        "name": "Seagate FireCuda 530 2TB Gen4 M.2 2280 PCIe NVMe Gaming SSD",
        "image": "https://www.potakait.com/image/cache/catalog/SSD/Seagate/firecuda-530-01-500x500.jpg-550x550.jpg",
        "description": "The Seagate FireCuda 530 2TB Gen4 M.2 2280 PCIe NVMe Gaming SSD is a high-performance solid-state drive (SSD) designed for gamers and creative professionals who demand the fastest possible storage speeds.",
        "price": "25500",
        "category": "SSD",
        "rating": "5",
        "creation_time": "2022-02-22 23:33:37"
    },
    {
        "id": "34",
        "brand": "samsung",
        "name": "Samsung PM9A1 2TB M.2 PCIe Gen 4.0 NVMe SSD",
        "image": "https://www.potakait.com/image/cache/catalog/SSD/samsung%20ssd/Samsung%20PM9A1.jpg-550x550.jpg",
        "description": "The Samsung PM9A1 2TB M.2 PCIe Gen 4.0 NVMe SSD adds storage to your desktop or laptop computer. With a 2TB capacity, you can easily store a large amount of data and applications while benefiting from enhanced read and write speeds of up to 7000MB/s and 5200MB/s, respectively. This drive fits into your desktop or notebook's M.2 slot and includes PCIe 4.0 x4 NVMe technology for constant performance that is excellent for professionals, casual users, and gamers alike. M.2 connections are simple to include in designs.",
        "price": "21500",
        "category": "SSD",
        "rating": "5",
        "creation_time": "2020-06-12 04:11:22"
    },
    {
        "id": "35",
        "brand": "samsung",
        "name": "SAMSUNG 990 PRO 2TB PCIE 4.0 M.2 NVME SSD",
        "image": "https://www.potakait.com/image/cache/catalog/products/components/ssd/samsung/samsung-990-pro-2tb/samsung-990-pro-2tb-ssd.jpg-550x550.jpg",
        "description": "The Samsung 990 Pro 2TB PCIe 4.0 M.2 NVMe SSD is an exceptional storage device that delivers lightning-fast speeds and unparalleled performance for high-end computing needs. With a capacity of 2TB, this solid-state drive (SSD) provides ample space to store a wide range of digital files, including games, videos, music, documents, and more.",
        "price": "22500",
        "category": "SSD",
        "rating": "5",
        "creation_time": "2023-06-05 06:27:56"
    },
    {
        "id": "36",
        "brand": "samsung",
        "name": "Samsung Odyssey G9 G95SC 49 Inch DQHD 240Hz Curved Smart Gaming Monitor",
        "image": "https://www.potakait.com/image/cache/catalog/monitor/Samsung/g9.jpg-550x550w.jpg",
        "description": "The Samsung Odyssey G9 G95SC 49 Inch DQHD 240Hz Curved Smart Gaming Monitor is a monster of a gaming display, offering a feature-packed experience for serious PC gamers.",
        "price": "455500",
        "category": "monitor",
        "rating": "5",
        "creation_time": "2022-12-09 00:43:04"
    },
    {
        "id": "37",
        "brand": "LG",
        "name": "LG 32EP950-B 32 Inch UltraFine OLED Pro 4K Professional Monitor",
        "image": "https://www.potakait.com/image/cache/catalog/Monitor/LG%20Mo/lg-32ep950-b-32-inch-4K-monitor-01.jpg-550x550.jpg",
        "description": "The LG 32EP950-B is a premium 32-inch UltraFine OLED Pro 4K monitor designed for professionals and demanding users seeking exceptional visual quality. Its OLED panel delivers deep blacks, infinite contrast ratio, and vivid colors, producing stunningly realistic images. The 4K resolution ensures sharp details and clarity, making it ideal for graphic design, video editing, and content creation. To enhance user experience, it offers features like HDR support, 98% DCI-P3 color gamut coverage, and a 60Hz refresh rate. The monitor's ergonomic stand provides height, tilt, swivel, and pivot adjustments for optimal viewing comfort. Additionally, it includes multiple connectivity options, including USB Type-C with power delivery, for a clean and organized workspace",
        "price": "455500",
        "category": "monitor",
        "rating": "5",
        "creation_time": "2020-06-30 21:56:53"
    },
    {
        "id": "38",
        "brand": "LG",
        "name": "LG 38WR85QC-W 38\" WQHD+ UltraWide 144Hz Curved Monitor",
        "image": "https://www.potakait.com/image/cache/catalog/Monitor/LG%20Mo/38wr85qc-w-001.jpg-550x550.jpg",
        "description": "The LG 38WR85QC-W is a premium 38-inch ultrawide curved monitor designed for professionals and demanding users seeking an immersive and productive workspace. Its WQHD+ resolution (3840x1600) and Nano IPS panel technology deliver exceptional visual quality with stunning colors, deep blacks, and wide viewing angles. The monitor's 144Hz refresh rate and 1ms response time ensure smooth and fluid performance, making it ideal for both work and play. To enhance the user experience, it incorporates features like VESA DisplayHDR 600, AMD FreeSync Premium, and a built-in KVM switch. The ergonomic stand offers height, tilt, swivel, and pivot adjustments for optimal viewing comfort. With its sleek design and advanced functionalities, the LG 38WR85QC-W elevates the monitor experience to a new level.",
        "price": "216500",
        "category": "monitor",
        "rating": "5",
        "creation_time": "2020-05-04 21:47:54"
    },
    {
        "id": "39",
        "brand": "LG",
        "name": "LG 43SQ700S-W 43\" 4K UHD IPS MyView Smart Monitor with webOS",
        "image": "https://www.potakait.com/image/cache/catalog/Monitor/LG%20Mo/43sq700s-w-01.jpg-550x550.jpg",
        "description": "The LG 43SQ700S-W is a versatile 43-inch 4K UHD IPS monitor that seamlessly blends the capabilities of a traditional display with a smart TV. Its expansive screen size and high resolution deliver stunning visuals, making it suitable for work, entertainment, and gaming. The IPS panel technology ensures accurate colors and wide viewing angles. Beyond its display prowess, the monitor incorporates webOS, offering access to a wealth of streaming services, apps, and smart features. With built-in speakers, multiple connectivity options including USB Type-C with power delivery, and a sleek design, the LG 43SQ700S-W provides a comprehensive computing and entertainment experience",
        "price": "122500",
        "category": "monitor",
        "rating": "5",
        "creation_time": "2021-08-01 11:00:41"
    },
    {
        "id": "40",
        "brand": "LG",
        "name": "LG 34WQ75C-B 34\" Curved UltraWide QHD IPS Monitor",
        "image": "https://www.potakait.com/image/cache/catalog/Monitor/LG%20Mo/34wq75c-b-01.jpg-550x550.jpg",
        "description": "The LG 34WQ75C-B is a 34-inch curved ultrawide monitor designed to enhance productivity and visual immersion. Its WQHD resolution (3440 x 1440 pixels) offers a wider and more expansive viewing area compared to traditional 16:9 monitors. The IPS panel technology ensures accurate color reproduction and wide viewing angles, making it suitable for various tasks, from content creation to gaming. The monitor incorporates features like HDR10, which enhances contrast and color depth, and a built-in KVM switch for seamless control between multiple devices. Its ergonomic stand allows for height, tilt, swivel, and pivot adjustments, promoting optimal viewing comfort.",
        "price": "110500",
        "category": "monitor",
        "rating": "5",
        "creation_time": "2020-10-29 06:26:42"
    }
]